<a href="https://colab.research.google.com/github/Subhamks69/coLab/blob/main/Ait_lab_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

data={
    'name':['Alice','Bob','Charlie','David','Eve'],
    'age': [25,30,35,40,38],
    'city': ['New York','London', 'Paris','Tokyo','London'],
    'salary':[50000,60000,55000,65000,62000]
}
df = pd.DataFrame(data)
print ("Original DataFrame :")
print(df)

Original DataFrame :
      name  age      city  salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   35     Paris   55000
3    David   40     Tokyo   65000
4      Eve   38    London   62000

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   city    5 non-null      object
 3   salary  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes
None

In [ ]:
print(df.describe())

             age        salary
count   5.000000      5.000000
mean   33.600000  58400.000000
std     6.107373   5941.380311
min    25.000000  50000.000000
25%    30.000000  55000.000000
50%    35.000000  60000.000000
75%    38.000000  62000.000000
max    40.000000  65000.000000

In [ ]:
print(df.head(2))
print(df.head(5))
print(df.tail(2))

    name  age      city  salary
0  Alice   25  New York   50000
1    Bob   30    London   60000
      name  age      city  salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   35     Paris   55000
3    David   40     Tokyo   65000
4      Eve   38    London   62000
    name  age    city  salary
3  David   40   Tokyo   65000
4    Eve   38  London   62000

In [ ]:
print(df.shape)

(5, 4)

In [ ]:
print(df['name'])
print(df['age'])
print(df[['name','age']])

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: name, dtype: object
0    25
1    30
2    35
3    40
4    38
Name: age, dtype: int64
      name  age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   38

In [ ]:
print(df.iloc[1])

name         Bob
age           30
city      London
salary     60000
Name: 1, dtype: object

In [ ]:
print(df.loc[1,'city'])

London

In [ ]:
print(df.iloc[0:4,0:2])

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

In [ ]:
print(df.loc[0:4,['name','age','city']])

      name  age      city
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo
4      Eve   38    London

In [ ]:
print(df.loc[1:4,['age','city']])

   age    city
1   30  London
2   35   Paris
3   40   Tokyo
4   38  London

In [ ]:
print(df.loc[df['age']>30])

      name  age    city  salary
2  Charlie   35   Paris   55000
3    David   40   Tokyo   65000
4      Eve   38  London   62000

In [ ]:
print(df.loc[df['age']>30],['name'])

      name  age    city  salary
2  Charlie   35   Paris   55000
3    David   40   Tokyo   65000
4      Eve   38  London   62000 ['name']

In [ ]:
df.loc[df['city']=='London',['name']]

  name
1  Bob
4  Eve

In [ ]:
 df['country'] = ['usa','uk','france','japan','uk']
 print("added 'country' column :")
 print(df)

added 'country' column :
      name  age      city  salary country
0    Alice   25  New York   50000     usa
1      Bob   30    London   60000      uk
2  Charlie   35     Paris   55000  france
3    David   40     Tokyo   65000   japan
4      Eve   38    London   62000      uk

In [ ]:
 df.loc[len(df)] = ['frank',32,'parice',820000,'france']
 print(df)

      name  age      city  salary country
0    Alice   25  New York   50000     usa
1      Bob   30    London   60000      uk
2  Charlie   35     Paris   55000  france
3    David   40     Tokyo   65000   japan
4      Eve   38    London   62000      uk
5    frank   32    parice  820000  france

In [ ]:
print(df.sort_values('age',ascending=False))
print(df.sort_values('age',ascending=True))

      name  age      city  salary country
3    David   40     Tokyo   65000   japan
4      Eve   38    London   62000      uk
2  Charlie   35     Paris   55000  france
5    frank   32    parice  820000  france
1      Bob   30    London   60000      uk
0    Alice   25  New York   50000     usa
      name  age      city  salary country
0    Alice   25  New York   50000     usa
1      Bob   30    London   60000      uk
5    frank   32    parice  820000  france
2  Charlie   35     Paris   55000  france
4      Eve   38    London   62000      uk
3    David   40     Tokyo   65000   japan